sonydevworld/spresense-arduino-compatible/Arduino15/packages/SPRESENSE/hardware/spresense/1.0.0/boards.txt
menu.Debug=Debug
menu.Core=Core
menu.UploadSpeed=UploadSpeed

############## Spresense BOARD ##############
spresense.name=Spresense

spresense.vid.0=0x10C4
spresense.pid.0=0xEA60

spresense.upload.tool=spresense-tools
spresense.upload.speed=115200
spresense.upload.resetmethod=ck
spresense.upload.maximum_size=786432
spresense.upload.maximum_data_size=786432
spresense.upload.wait_for_upload_port=true
spresense.serial.disableDTR=false
spresense.serial.disableRTS=true

spresense.bootloader.tool=spresense-tools

spresense.build.mcu=spresense
spresense.build.f_cpu=156000000L
spresense.build.board=spresense_ast
spresense.build.core=spresense

spresense.menu.Core.Main=MainCore
spresense.menu.Core.Sub1=SubCore 1
spresense.menu.Core.Sub2=SubCore 2
spresense.menu.Core.Sub3=SubCore 3
spresense.menu.Core.Sub4=SubCore 4
spresense.menu.Core.Sub5=SubCore 5

spresense.menu.Core.Sub1.index=1
spresense.menu.Core.Sub2.index=2
spresense.menu.Core.Sub3.index=3
spresense.menu.Core.Sub4.index=4
spresense.menu.Core.Sub5.index=5

spresense.menu.Core.Main.build.flash_name=nuttx
spresense.menu.Core.Sub1.build.flash_name=sub1
spresense.menu.Core.Sub2.build.flash_name=sub2
spresense.menu.Core.Sub3.build.flash_name=sub3
spresense.menu.Core.Sub4.build.flash_name=sub4
spresense.menu.Core.Sub5.build.flash_name=sub5

spresense.build.extra_flags=-DSUBCORE={index}
spresense.menu.Core.Main.build.extra_flags=

spresense.build.type_prefix=subcore-
spresense.menu.Core.Main.build.type_prefix=

spresense.build.variant=spresense_sub
spresense.menu.Core.Main.build.variant=spresense

spresense.build.stack=
spresense.menu.Core.Main.build.stack=-Wl,--defsym,__stack=_vectors+{upload.maximum_size}

spresense.build.ldscript=-T{variant.path}/ramconfig.ld
spresense.build.root={runtime.tools.spresense-sdk.path}/spresense
spresense.build.kernel={build.root}/{build.type}
spresense.build.libpath={build.kernel}/prebuilt

spresense.menu.Debug.Disabled=Disabled
spresense.menu.Debug.Disabled.build.debug=
spresense.menu.Debug.Disabled.build.type={build.type_prefix}release

spresense.menu.Debug.Enabled=Enabled
spresense.menu.Debug.Enabled.build.debug=-DBRD_DEBUG
spresense.menu.Debug.Enabled.build.type={build.type_prefix}debug

spresense.menu.UploadSpeed.115200=115200
spresense.menu.UploadSpeed.115200.upload.speed=
spresense.menu.UploadSpeed.230400=230400
spresense.menu.UploadSpeed.230400.upload.speed=-b 230400
spresense.menu.UploadSpeed.460800=460800
spresense.menu.UploadSpeed.460800.upload.speed=-b 460800
spresense.menu.UploadSpeed.500000=500000
spresense.menu.UploadSpeed.500000.upload.speed=-b 500000
spresense.menu.UploadSpeed.576000=576000
spresense.menu.UploadSpeed.576000.upload.speed=-b 576000
spresense.menu.UploadSpeed.921600=921600
spresense.menu.UploadSpeed.921600.upload.speed=-b 921600
spresense.menu.UploadSpeed.1000000=1000000
spresense.menu.UploadSpeed.1000000.upload.speed=-b 1000000
spresense.menu.UploadSpeed.1152000=1152000
spresense.menu.UploadSpeed.1152000.upload.speed=-b 1152000

